[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:61:76
     );
   }
 
-  return <OurTable data={diningCommonsMenuItems} columns={columns} testid={"UCSBDiningCommonsMenuItemTable"} />;
+  return <OurTable data={diningCommonsMenuItems} columns={columns} testid={""} />;
 }
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid=""
