[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:8:30
 import { toast } from "react-toastify";
 
 export default function UCSBDiningCommonsMenuItemCreatePage({ storybook = false }) {
- const objectToAxiosParams = (ucsbdiningcommonsmenuitem) => ({
-    url: "/api/ucsbdiningcommonsmenuitem/post",
-    method: "POST",
-    params: {
-      diningCommonsCode: ucsbdiningcommonsmenuitem.diningCommonsCode,
-      name: ucsbdiningcommonsmenuitem.name,
-      station: ucsbdiningcommonsmenuitem.station,
-    },
-  });
+ const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbdiningcommonsmenuitem) => {
killedBy: UCSBDiningCommonsMenuItem tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:18:52
     },
   });
 
-  const onSuccess = (ucsbdiningcommonsmenuitem) => {
-        toast(`New ucsbDiningCommonsMenuItem Created - id: ${ucsbdiningcommonsmenuitem.id} name: ${ucsbdiningcommonsmenuitem.name}`);
-  };
+  const onSuccess = (ucsbdiningcommonsmenuitem) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItem tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Number of calls: 0
