[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/ucsbdiningcommonsmenuitem?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/ucsbdiningcommonsmenuitem`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-diningCommonsCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:34:11
     params: {
       id: ucsbdiningcommonsmenuitem.id,
     },
-    data: {
-      diningCommonsCode: ucsbdiningcommonsmenuitem.diningCommonsCode,
-      name: ucsbdiningcommonsmenuitem.name,
-      station: ucsbdiningcommonsmenuitem.station,
-    },
+    data: {},
   });
 
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected '{}' to be '{"diningCommonsCode":"BLS","name":"Ch…' // Object.is equality

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:41:52
     },
   });
 
-  const onSuccess = (ucsbdiningcommonsmenuitem) => {
-    toast(`UCSBDiningCommonsMenuItem Updated - id: ${ucsbdiningcommonsmenuitem.id} name: ${ucsbdiningcommonsmenuitem.name}`);
-  };
+  const onSuccess = (ucsbdiningcommonsmenuitem) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:58:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/diningcommonsmenuitem" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called with arguments: [ { to: '/diningcommonsmenuitem' } ]

Number of calls: 0

[Killed] LogicalOperator
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:66:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonsMenuItem</h1>
-        {ucsbdiningcommonsmenuitem && (
-          <UCSBDiningCommonsMenuItemForm
-            initialContents={ucsbdiningcommonsmenuitem}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {ucsbdiningcommonsmenuitem || <UCSBDiningCommonsMenuItemForm initialContents={ucsbdiningcommonsmenuitem} submitAction={onSubmit} buttonLabel="Update" />}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input
  class="form-control"
  data-testid="UCSBDiningCommonsMenuItemForm-diningCommonsCode"
  id="diningCommonsCode"
  name="diningCommonsCode"
  type="text"

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.jsx:66:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonsMenuItem</h1>
-        {ucsbdiningcommonsmenuitem && (
-          <UCSBDiningCommonsMenuItemForm
-            initialContents={ucsbdiningcommonsmenuitem}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemForm-diningCommonsCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
