[Killed] BlockStatement
main/components/HelpRequest/HelpRequestTable.jsx:14:36
 export default function HelpRequestTable({ helpRequests, currentUser }) {
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        const id = cell.row.original.id;
-        navigate(`/helprequests/edit/${id}`);
-    };
+    const editCallback = (cell) => {};
 
     // Stryker disable all : hard to test for query caching / invalidation key
killedBy: HelpRequestTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/helprequests/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/HelpRequest/HelpRequestTable.jsx:27:44
     );
     // Stryker restore all
 
-    const deleteCallback = async (cell) => {
-        const id = cell.row.original.id;
-        deleteMutation.mutate({ row: { values: { id }, original: {} } });
-    };
+    const deleteCallback = async (cell) => {};
 
     const columns = [
killedBy: HelpRequestIndexPage tests what happens when you click delete, admin
statusReason: expected "spy" to be called with arguments: [ 'Helprequest with id 1 was deleted' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.jsx:29:31
 
     const deleteCallback = async (cell) => {
         const id = cell.row.original.id;
-        deleteMutation.mutate({ row: { values: { id }, original: {} } });
+        deleteMutation.mutate({});
     };
 
killedBy: HelpRequestTable tests Delete button calls delete endpoint with id param
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:36:19
         { header: "id", accessorKey: "id" },
         { header: "Requester Email", accessorKey: "requesterEmail" },
         { header: "Table Or Breakout Room", accessorKey: "tableOrBreakoutRoom" },
-        { header: "Team ID", accessorKey: "teamId" },
+        { header: "", accessorKey: "teamId" },
         { header: "Request Time", accessorKey: "requestTime" },
         { header: "Explanation", accessorKey: "explanation" },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Team ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:37:48
         { header: "Requester Email", accessorKey: "requesterEmail" },
         { header: "Table Or Breakout Room", accessorKey: "tableOrBreakoutRoom" },
         { header: "Team ID", accessorKey: "teamId" },
-        { header: "Request Time", accessorKey: "requestTime" },
+        { header: "Request Time", accessorKey: "" },
         { header: "Explanation", accessorKey: "explanation" },
         {
killedBy: HelpRequestTable tests Has expected headers, content, and admin buttons
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-requestTime"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] ArrowFunction
main/components/HelpRequest/HelpRequestTable.jsx:42:19
         {
             header: "Solved",
             id: "solved",
-            cell: ({ row }) => row.original.solved.toString(),
+            cell: () => undefined,
         },
     ];
killedBy: HelpRequestTable tests Has expected headers, content, and admin buttons
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
