[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.jsx:33:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={"MenuItemReviewForm-id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {initialContents || <Form.Group className="mb-3">
+          <Form.Label htmlFor="id">Id</Form.Label>
+          <Form.Control data-testid={"MenuItemReviewForm-id"} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+        </Form.Group>}
 
       <Form.Group className="mb-3">
killedBy: MenuItemReviewEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-itemId"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.jsx:33:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={"MenuItemReviewForm-id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {true}
 
       <Form.Group className="mb-3">
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:37:26
         <Form.Group className="mb-3">
           <Form.Label htmlFor="id">Id</Form.Label>
           <Form.Control
-            data-testid={"MenuItemReviewForm-id"}
+            data-testid={""}
             id="id"
             type="text"
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:54:34
           id="itemId"
           type="number"
           isInvalid={Boolean(errors.itemId)}
-          {...register("itemId", {
-            required: true,
-          })}
+          {...register("itemId", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /ItemId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.jsx:77:12
         />
         <Form.Control.Feedback type="invalid">
           {errors.reviewerEmail && "ReviewerEmail is required. "}
-          {errors.reviewerEmail?.type === "pattern" &&
-            "ReviewerEmail must be a valid email."}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /ReviewerEmail must be a valid email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:78:13
         <Form.Control.Feedback type="invalid">
           {errors.reviewerEmail && "ReviewerEmail is required. "}
           {errors.reviewerEmail?.type === "pattern" &&
-            "ReviewerEmail must be a valid email."}
+            ""}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /ReviewerEmail must be a valid email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:89:33
           id="stars"
           type="number"
           isInvalid={Boolean(errors.stars)}
-          {...register("stars", {
-            required: true,
-            min: 1,
-            max: 5,
-          })}
+          {...register("stars", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Stars is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] EqualityOperator
main/components/MenuItemReview/MenuItemReviewForm.jsx:97:12
         />
         <Form.Control.Feedback type="invalid">
           {errors.stars && "Stars is required. "}
-          {errors.stars?.type === "min" && "Stars must be at least 1."}
+          {errors.stars?.type !== "min" && "Stars must be at least 1."}
           {errors.stars?.type === "max" && "Stars must be at most 5."}
         </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Stars must be at least 1./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.jsx:97:12
         />
         <Form.Control.Feedback type="invalid">
           {errors.stars && "Stars is required. "}
-          {errors.stars?.type === "min" && "Stars must be at least 1."}
+          {errors.stars.type === "min" && "Stars must be at least 1."}
           {errors.stars?.type === "max" && "Stars must be at most 5."}
         </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.jsx:98:12
         <Form.Control.Feedback type="invalid">
           {errors.stars && "Stars is required. "}
           {errors.stars?.type === "min" && "Stars must be at least 1."}
-          {errors.stars?.type === "max" && "Stars must be at most 5."}
+          {false}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input 2
statusReason: Unable to find an element with the text: /Stars must be at most 5./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.jsx:98:12
         <Form.Control.Feedback type="invalid">
           {errors.stars && "Stars is required. "}
           {errors.stars?.type === "min" && "Stars must be at least 1."}
-          {errors.stars?.type === "max" && "Stars must be at most 5."}
+          {errors.stars?.type === "max" || "Stars must be at most 5."}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input 2
statusReason: Unable to find an element with the text: /Stars must be at most 5./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
