[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:83:39
         <Form.Control
           as="textarea"
           rows={3}
-          data-testid={testIdPrefix + "-explanation"}
+          data-testid={testIdPrefix + ""}
           id="explanation"
           isInvalid={Boolean(errors.explanation)}
killedBy: ArticlesForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="ArticlesForm-explanation"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
