[Killed] BlockStatement
main/components/HelpRequest/HelpRequestTable.jsx:14:36
 export default function HelpRequestTable({ helpRequests, currentUser }) {
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        const id = cell.row.original.id;
-        navigate(`/helprequest/edit/${id}`);
-    };
+    const editCallback = (cell) => {};
 
     // Stryker disable all : hard to test for query caching / invalidation key
killedBy: HelpRequestTable tests Edit button navigates to the edit page
statusReason: expected "spy" to be called with arguments: [ '/helprequest/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />
