[Killed] ArrowFunction
main/pages/Articles/ArticlesCreatePage.jsx:9:31
 import { normalizeDateTime } from "main/utils/dateUtils";
 
 export default function ArticlesCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (article) => ({
-    url: "/api/articles/post",
-    method: "POST",
-    params: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      dateAdded: normalizeDateTime(article.dateAdded),
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (article) => {
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/Articles/ArticlesCreatePage.jsx:12:13
   const objectToAxiosParams = (article) => ({
     url: "/api/articles/post",
     method: "POST",
-    params: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      dateAdded: normalizeDateTime(article.dateAdded),
-    },
+    params: {},
   });
 
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected {} to match object { …(4) }

[Killed] StringLiteral
main/pages/Articles/ArticlesCreatePage.jsx:22:11
   });
 
   const onSuccess = (article) => {
-    toast(`New article Created - id: ${article.id} title: ${article.title}`);
+    toast(``);
   };
 
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "New article Created - id: 7 title: How to test React forms",
