[Killed] ArrowFunction
main/pages/Articles/ArticlesEditPage.jsx:29:34
   );
 
   // PUT 参数构造（注意把 dateAdded 规范成 T00:00:00）
-  const objectToAxiosPutParams = (a) => ({
-    url: "/api/articles",
-    method: "PUT",
-    params: { id: a.id },
-    data: {
-      title: a.title,
-      url: a.url,
-      explanation: a.explanation,
-      email: a.email,
-      dateAdded: normalizeDateTime(a.dateAdded),
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (a) => {
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided and sends PUT with normalized date
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Article Updated - id: 17 title: How to write better tests",

[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.jsx:29:42
   );
 
   // PUT 参数构造（注意把 dateAdded 规范成 T00:00:00）
-  const objectToAxiosPutParams = (a) => ({
-    url: "/api/articles",
-    method: "PUT",
-    params: { id: a.id },
-    data: {
-      title: a.title,
-      url: a.url,
-      explanation: a.explanation,
-      email: a.email,
-      dateAdded: normalizeDateTime(a.dateAdded),
-    },
-  });
+  const objectToAxiosPutParams = (a) => ({});
 
   const onSuccess = (a) => {
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided and sends PUT with normalized date
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Article Updated - id: 17 title: How to write better tests",

[Killed] StringLiteral
main/pages/Articles/ArticlesEditPage.jsx:30:10
 
   // PUT 参数构造（注意把 dateAdded 规范成 T00:00:00）
   const objectToAxiosPutParams = (a) => ({
-    url: "/api/articles",
+    url: "",
     method: "PUT",
     params: { id: a.id },
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided and sends PUT with normalized date
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Article Updated - id: 17 title: How to write better tests",

[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.jsx:33:11
     url: "/api/articles",
     method: "PUT",
     params: { id: a.id },
-    data: {
-      title: a.title,
-      url: a.url,
-      explanation: a.explanation,
-      email: a.email,
-      dateAdded: normalizeDateTime(a.dateAdded),
-    },
+    data: {},
   });
 
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided and sends PUT with normalized date
statusReason: expected '{}' to be '{"title":"How to write better tests",…' // Object.is equality

[Killed] BlockStatement
main/pages/Articles/ArticlesEditPage.jsx:42:28
     },
   });
 
-  const onSuccess = (a) => {
-    toast(`Article Updated - id: ${a.id} title: ${a.title}`);
-  };
+  const onSuccess = (a) => {};
 
   const mutation = useBackendMutation(
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided and sends PUT with normalized date
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
main/pages/Articles/ArticlesEditPage.jsx:67:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Article</h1>
-        {article && (
-          <ArticlesForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={article}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: ArticlesEditPage tests tests where backend is working normally Is populated with the data provided and sends PUT with normalized date
statusReason: Unable to find an element by: [data-testid="ArticlesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
