[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.jsx:29:44
 
   const deleteCallback = async (cell) => {
     const id = cell.row.original.id;
-    deleteMutation.mutate({ row: { values: { id }, original: {} } });
+    deleteMutation.mutate({ row: { values: {}, original: {} } });
   };
 
killedBy: HelpRequestTable tests Delete button calls delete endpoint with id param
statusReason: expected { id: undefined } to deeply equal { id: 1 }

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.jsx:35:5
   const columns = [
     { header: "id", accessorKey: "id" },
     { header: "Requester Email", accessorKey: "requesterEmail" },
-    { header: "Table Or Breakout Room", accessorKey: "tableOrBreakoutRoom" },
+    {},
     { header: "Team ID", accessorKey: "teamId" },
     { header: "Request Time", accessorKey: "requestTime" },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:36:39
     { header: "id", accessorKey: "id" },
     { header: "Requester Email", accessorKey: "requesterEmail" },
     { header: "Table Or Breakout Room", accessorKey: "tableOrBreakoutRoom" },
-    { header: "Team ID", accessorKey: "teamId" },
+    { header: "Team ID", accessorKey: "" },
     { header: "Request Time", accessorKey: "requestTime" },
     { header: "Explanation", accessorKey: "explanation" },
killedBy: HelpRequestTable tests Has expected headers, content, and admin buttons
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-teamId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"
