[Killed] StringLiteral
main/components/Articles/ArticlesTable.jsx:38:15
     { header: "Title", accessorKey: "title" },
     { header: "URL", accessorKey: "url" },
     { header: "Explanation", accessorKey: "explanation" },
-    { header: "Email", accessorKey: "email" },
+    { header: "", accessorKey: "email" },
     { header: "Date Added", accessorKey: "dateAdded" },
   ];
killedBy: ArticlesTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ArticlesTable"
