[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.jsx:7:41
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export const normalizeDateTime = (v) => {
-  // Stryker disable next-line ConditionalExpression : behavior is identical for falsy v
-  if (!v) return v;
-  if (/^\d{4}-\d{2}-\d{2}$/.test(v)) return `${v}T00:00:00`;
-  return v;
-};
+export const normalizeDateTime = (v) => {};
 export default function ArticlesCreatePage({ storybook = false }) {
   const objectToAxiosParams = (article) => ({
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected undefined to be '2024-10-31T00:00:00' // Object.is equality

[Killed] BooleanLiteral
main/pages/Articles/ArticlesCreatePage.jsx:9:7
 
 export const normalizeDateTime = (v) => {
   // Stryker disable next-line ConditionalExpression : behavior is identical for falsy v
-  if (!v) return v;
+  if (v) return v;
   if (/^\d{4}-\d{2}-\d{2}$/.test(v)) return `${v}T00:00:00`;
   return v;
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected '2024-10-31' to be '2024-10-31T00:00:00' // Object.is equality

[Killed] ConditionalExpression
main/pages/Articles/ArticlesCreatePage.jsx:10:7
 export const normalizeDateTime = (v) => {
   // Stryker disable next-line ConditionalExpression : behavior is identical for falsy v
   if (!v) return v;
-  if (/^\d{4}-\d{2}-\d{2}$/.test(v)) return `${v}T00:00:00`;
+  if (false) return `${v}T00:00:00`;
   return v;
 };
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected '2024-10-31' to be '2024-10-31T00:00:00' // Object.is equality

[Killed] ConditionalExpression
main/pages/Articles/ArticlesCreatePage.jsx:10:7
 export const normalizeDateTime = (v) => {
   // Stryker disable next-line ConditionalExpression : behavior is identical for falsy v
   if (!v) return v;
-  if (/^\d{4}-\d{2}-\d{2}$/.test(v)) return `${v}T00:00:00`;
+  if (true) return `${v}T00:00:00`;
   return v;
 };
killedBy: ArticlesCreatePage tests normalizeDateTime keeps original when already has time
statusReason: expected '2024-10-31T12:34:56T00:00:00' to be '2024-10-31T12:34:56' // Object.is equality

[Killed] BooleanLiteral
main/pages/Articles/ArticlesCreatePage.jsx:13:58
   if (/^\d{4}-\d{2}-\d{2}$/.test(v)) return `${v}T00:00:00`;
   return v;
 };
-export default function ArticlesCreatePage({ storybook = false }) {
+export default function ArticlesCreatePage({ storybook = true }) {
   const objectToAxiosParams = (article) => ({
     url: "/api/articles/post",
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected "spy" to be called with arguments: [ { to: '/articles' } ]

Number of calls: 0

[Killed] ObjectLiteral
main/pages/Articles/ArticlesCreatePage.jsx:14:45
   return v;
 };
 export default function ArticlesCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (article) => ({
-    url: "/api/articles/post",
-    method: "POST",
-    params: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      email: article.email,
-      dateAdded: normalizeDateTime(article.dateAdded),
-    },
-  });
+  const objectToAxiosParams = (article) => ({});
 
   const onSuccess = (article) => {
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
