[Killed] BlockStatement
main/pages/Articles/ArticlesIndexPage.jsx:3:45
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function ArticlesIndexPage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Articles Index page not yet implemented</h1>
-        <p>
-          <a href="/articles/create">Create</a>
-        </p>
-        <p>
-          <a href="/articles/edit/1">Edit</a>
-        </p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function ArticlesIndexPage() {}
 
killedBy: ArticlesIndexPage tests Renders expected content
statusReason: Unable to find an element with the text: Articles Index page not yet implemented. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
