[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:19:24
   // Stryker restore all
 
   const navigate = useNavigate();
-  const testIdPrefix = "ArticlesForm";
+  const testIdPrefix = "";
 
   return (
killedBy: ArticlesForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="ArticlesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.jsx:24:8
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       {/* id only shown when editing (initialContents is defined) */}
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {false}
 
       {/* Title */}
killedBy: ArticlesForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="ArticlesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.jsx:24:8
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       {/* id only shown when editing (initialContents is defined) */}
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-id"}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {true}
 
       {/* Title */}
killedBy: ArticlesForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="ArticlesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.jsx:48:24
           isInvalid={Boolean(errors.title)}
           {...register("title", {
             required: "Title is required.",
-            maxLength: {
-              value: 100,
-              message: "Max length 100 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Max length 100 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.jsx:108:31
     id="dateAdded"
     type="date"
     isInvalid={Boolean(errors.dateAdded)}
-    {...register("dateAdded", {
-      required: "Date Added is required.",
-    })}
+    {...register("dateAdded", {})}
   />
   <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Date Added is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.jsx:126:33
           type="email"
           placeholder="name@example.com"
           isInvalid={Boolean(errors.email)}
-          {...register("email", {
-            required: "Email is required.",
-            // // RFC5322-ish pragmatic email regex
-            // pattern: {
-            //   value:
-            //     /^[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,}$/i,
-            //   message: "Please enter a valid email address",
-            // },
-          })}
+          {...register("email", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
