[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.jsx:54:46
               type="text"
               placeholder="e.g. davidgaucho@ucsb.edu"
               isInvalid={Boolean(errors.requesterEmail)}
-              {...register("requesterEmail", {
-                required: "Requester Email is required.",
-                pattern: {
-                  value: emailRegex,
-                  message: "Requester Email must be a valid email address.",
-                },
-              })}
+              {...register("requesterEmail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests shows correct error messages on bad input
statusReason: Unable to find an element with the text: /Requester Email must be a valid email address\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.jsx:81:28
                 required: "Team Id must be a number.",
                 pattern: {
                   value: idRegex,
-                  message: "Team Id must be a number.",
+                  message: "",
                 },
               })}
killedBy: HelpRequestForm tests shows numeric pattern errors for Team Id and Table Or Breakout Room
statusReason: Unable to find an element with the text: /Team Id must be a number\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.jsx:126:43
               id="requestTime"
               type="datetime-local"
               isInvalid={Boolean(errors.requestTime)}
-              {...register("requestTime", {
-                required: true,
-                pattern: isoLocatRegex,
-              })}
+              {...register("requestTime", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests shows correct error messages on missing required fields
statusReason: Unable to find an element with the text: /Request Time is required\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
