[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.jsx:33:10
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-        {initialContents && (
-            <Form.Group className="mb-3">
-            <Form.Label htmlFor="id">Id</Form.Label>
-            <Form.Control
-                data-testid={"MenuItemReviewForm-id"}
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-            />
-            </Form.Group>
-        )}
+        {false}
 
         <Form.Group className="mb-3">
killedBy: MenuItemReviewForm tests renders correctly when passing in a MenuItemReview
statusReason: Unable to find an element by: [data-testid="/MenuItemReviewForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:55:31
                 type="number"
                 isInvalid={Boolean(errors.itemId)}
                 {...register("itemId", {
-                    required: true
+                    required: false
                 })}
             />
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /ItemId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.jsx:97:18
             />
             <Form.Control.Feedback type="invalid">
                 {errors.stars && "Stars is required. "}
-                {errors.stars?.type === "min" && "Stars must be at least 1."}
+                {true}
                 {errors.stars?.type === "max" && "Stars must be at most 5."}
             </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Stars must be at least 1./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.jsx:97:18
             />
             <Form.Control.Feedback type="invalid">
                 {errors.stars && "Stars is required. "}
-                {errors.stars?.type === "min" && "Stars must be at least 1."}
+                {true && "Stars must be at least 1."}
                 {errors.stars?.type === "max" && "Stars must be at most 5."}
             </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests No Error messsages on good input
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="invalid-feedback"
>
  Stars must be at least 1.
</div> instead

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.jsx:98:18
             <Form.Control.Feedback type="invalid">
                 {errors.stars && "Stars is required. "}
                 {errors.stars?.type === "min" && "Stars must be at least 1."}
-                {errors.stars?.type === "max" && "Stars must be at most 5."}
+                {errors.stars.type === "max" && "Stars must be at most 5."}
             </Form.Control.Feedback>
         </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'type')
